app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "いいね"], ["body", "いいね"], ["post_id", 3], ["created_at", "2018-08-29 03:37:38.620915"], ["updated_at", "2018-08-29 03:37:38.620915"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)