app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "最初"], ["text", "最初の投稿"], ["created_at", "2018-08-16 03:55:33.535218"], ["updated_at", "2018-08-16 03:55:33.535218"]]
---
  def create
    @post = Post.new(post_params)
    #@post.save
    #redirect_to @post
    #@post = Post.new(post_params)

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["text", "最初の投稿です。"], ["updated_at", "2018-08-28 03:46:28.519107"], ["id", 3]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)